import Navbar from "@/components/landing-page/Navbar";

export default function TermsPage() {
	return (
		<div className="min-h-screen bg-white">
			<Navbar />
			<main className="pt-32 pb-20 px-4 max-w-4xl mx-auto">
				<h1 className="text-4xl font-bold mb-8 text-[#012d46]">
					شروط الاستخدام
				</h1>
				<div className="space-y-6 text-gray-600 leading-relaxed">
					<p>
						مرحباً بك في موقع بِلفورا. باستخادمك لهذا الموقع، فإنك توافق على الالتزام بشروط الاستخدام التالية، والتي تحكم علاقة بِلفورا بك فيما يتعلق بهذا الموقع.
					</p>

					<h2 className="text-2xl font-semibold text-[#012d46]">
						استخدام الموقع
					</h2>
					<ul className="list-disc list-inside space-y-2 mr-4">
                        <li>محتوى صفحات هذا الموقع هو لمعلوماتك العامة واستخدامك فقط. وهو قابل للتغيير دون إشعار.</li>
                        <li>لا نقدم نحن ولا أي طرف ثالث أي ضمان أو كفالة فيما يتعلق بدقة أو توقيت أو أداء أو اكتمال أو ملاءمة المعلومات والمواد الموجودة أو المعروضة على هذا الموقع لأي غرض معين.</li>
                        <li>استخدامك لأي معلومات أو مواد على هذا الموقع هو على مسؤوليتك الخاصة تماماً، ولن نكون مسؤولين عن ذلك.</li>
                    </ul>

					<h2 className="text-2xl font-semibold text-[#012d46]">
						الملكية الفكرية
					</h2>
					<p>
						يحتوي هذا الموقع على مواد مملوكة لنا أو مرخصة لنا. تشمل هذه المواد، على سبيل المثال لا الحصر، التصميم والتخطيط والمظهر والرسومات. يحظر الاستنساخ إلا وفقاً لإشعار حقوق النشر، الذي يشكل جزءاً من هذه الشروط والأحكام.
					</p>

                    <h2 className="text-2xl font-semibold text-[#012d46]">
                        روابط لمواقع أخرى
                    </h2>
                    <p>
                        قد يشتمل هذا الموقع من وقت لآخر على روابط لمواقع أخرى. يتم توفير هذه الروابط لراحتك لتقديم مزيد من المعلومات. ولا يعني ذلك أننا نوصي بالموقع (المواقع). ولا نتحمل أي مسؤولية عن محتوى الموقع (المواقع) المرتبطة.
                    </p>
				</div>
			</main>
		</div>
	);
}

